package homework.coursework.game;

import java.util.Scanner;

public class ApplicationMain {
    public static void main(String[] args) {
        System.out.println("Начать Игру");
        Scanner scanner =new Scanner(System.in);

        }
    }
/*    // каждый пункт меню отдельная команда
    // Загрузить игру из файла, если нет файла, то нужно сообщить
    //
    // Выйти - завершить работу, просто выход, цикл завершился
    // Начало игры, возможность выйти обратно в меню
    // Сохранить игру сохраняем в файл
    // 2 варианта ответа выходв меню
    Игра завершается, удача не удача.
    Каждый вариант ответа это название какого нибуль параграфа

Взаимодействие с пользователем должно быть реализовано через консоль.
Меню должно быть реализовано с помощью паттерна Команда, где каждый пункт меню - отдельная команда.

Меню:
1. Начать игру
2. Загрузить игру
3. Выйти

После начала игры должна быть возможность выйти в меню при этом в меню появляется новый пункт 'Сохранить игру'.

Когда пользователь выбирает пункт 'Сохранить игру' состояние игры необходимо сохранять в файл и
восстанавливать при выборе пункта 'Загрузить игру'.

Параграфы-узлы в файле 'узлы-и-переходы.png'
Названия, текст параграфов-узлов и варианты ответов в файле 'текст-параграфов.md'
    */
}
