package homeworklesson6.storage;

public class Main {
    public static void main(String[] args) {
        /*хранилище: книги, номер хранилища;
        Книга: название, авторы, количество страниц, год издания (int);
        Автор: имя, фамилия.
                Книга может быть написана несколькоми авторами.
                Каждое хранилище расчитано на 20 книг (максимум).
                * Необходимо реализовать возможность добавления книг в хранилище по 1й.
                * В одно хранилище не может быть добавлено несколько книг с одинаковым названием.*/
    }
}
